{
  "class_name": "Functional",
  "config": {
    "name": "model_3",
    "trainable": true,
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "Embedding",
        "config": {
          "name": "embedding_3",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [
            null,
            150
          ],
          "input_dim": 1000,
          "output_dim": 50,
          "embeddings_initializer": {
            "module": "keras.initializers",
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            },
            "registered_name": null
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": false,
          "input_length": 150
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            150
          ]
        },
        "name": "embedding_3",
        "inbound_nodes": [
          [
            [
              "inputs",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_3",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 64,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0,
          "recurrent_dropout": 0,
          "implementation": 2
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            150,
            50
          ]
        },
        "name": "lstm_3",
        "inbound_nodes": [
          [
            [
              "embedding_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "FC1",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            64
          ]
        },
        "name": "FC1",
        "inbound_nodes": [
          [
            [
              "lstm_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_6",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            256
          ]
        },
        "name": "activation_6",
        "inbound_nodes": [
          [
            [
              "FC1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            256
          ]
        },
        "name": "dropout_3",
        "inbound_nodes": [
          [
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "out_layer",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            256
          ]
        },
        "name": "out_layer",
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "module": "keras.layers",
        "class_name": "Activation",
        "config": {
          "name": "activation_7",
          "trainable": true,
          "dtype": "float32",
          "activation": "sigmoid"
        },
        "registered_name": null,
        "build_config": {
          "input_shape": [
            null,
            1
          ]
        },
        "name": "activation_7",
        "inbound_nodes": [
          [
            [
              "out_layer",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "inputs",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "activation_7",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.14.0",
  "backend": "tensorflow"
}